// =========실습 과제 1============
// 16MB 메모리의 주소의 범위를 구하시오. : 0x000000 ~ 0xFFFFFF 이다
// 변수의 주소를 설명하시오. : 컴퓨터에 의해 자동으로 결정된다.
// 변수의 주소의 자료형은 무엇인가? : int 는 정수형, char 문자형, double float 는 실수형을 말한다.
// 포인터란 무엇인가? : 데이터 저장된 변수의 주소를 저장 하기위한 주소형 변수
// 포인터의 자료형은 무엇인가? : *int 은 정수형을 저장하기 위한 포인터, char 은 문자형을 저장하기 위한 포인터, *double *float 등은 실수형을 저장하기 위한 포인터
// 변수의 주소를 int형 변수에 저장하면 어떻게 되는가? : int형 변수 에는 변수를 저장해야 하므로 잘못된 연산이 될 수도 있다.

// =========실습 과제 2============
// double * pt;
// 다음에서 pt가 가리키는 데이터의 자료형은 무엇인가? : double형(실수형)
// 다음에서 pt에 저장될 주소의 자료형은 무엇인가? : double 포인터형
// 다음에서 pt의 자료형은 무엇인가? : double 포인터형
// 다음 처럼 포인터를 선언할 때 double의 의미를 설명하라. : 주소가 가르키는 변수의 자료형
// 포인터 변수 pt가 메모리에 할당될 때 메모리 크기는? : 8바이트
